<?php

namespace App\Http\Controllers\WebService;

use Illuminate\Http\Request;
use App\Http\Controllers\Controller;
use App\Models\MerchantCorp as MerchantCorpModel;
use App\Models\Preset as PresetModel;
use App\Helpers\Pdate;

class SearchController extends Controller
{
    public function index()
    {
        // $appender = array(
        //     [
        //         'logo_corp' => '',
        //         'user_image' => '',
        //         'first_name' => '',
        //         'last_name' => '',
        //         'corp_name' => '',
        //         'year_created' => '',
        //         'province' => '',
        //         'province_id' => '',
        //         'city' => '',
        //         'address' => '',
        //         'phone' => '',
        //         'fax' => '',
        //         'website' => '',
        //         'activity' => '',
        //         'activity_type' => '',
        //         'activity_type_id' => '',
        //         'orders_registered' => '',
        //         'imports_done' => '',
        //         'certificate_issued' => '',
        //         'common_rooms' => '',
        //         'spec_commissions' => '',
        //         'organizations' => '',
        //         'person_type' => '',
        //         'person_type_id' => '',
        //         'hs_code' => '',
        //         'products' => '',
        //         'rank' => '',
        //         'rank_id' => '',
        //         'last_updated_at' => Pdate::persianTimeStampNow(),
        //     ]
        // );
        // $data = [];
        // for ($i = 0; $i <= 2; $i++) {
        //     $data = array_merge($data, $appender);
        // }

        // return response()->json([
        //     'data' => $data,
        //     'req' => request()->all(),
        // ], 200);
    }
    public function get_filters_var()
    {
        $presets = PresetModel::select('value', 'title', 'type')
            ->get()->toArray();
        $person_types = [];
        $province = [];
        $rank = [];
        $activity_type = [];
        foreach ($presets as $preset) {
            $_type = $preset['type'];
            switch ($_type) {
                case "person_type":
                    $person_types[$preset['value']] = $preset['title'];
                    break;
                case "province":
                    $province[$preset['value']] = $preset['title'];
                    break;
                case "rank":
                    $rank[$preset['value']] = $preset['title'];
                    break;
                case "activity_type":
                    $activity_type[$preset['value']] = $preset['title'];
                    break;
                default:
                    //Do Nothing !
            }
        }

        return response()->json([
            'data' => [
                'person_types' => prepareSelect($person_types),
                'provinces' => prepareSelect($province),
                'ranks' => prepareSelect($rank),
                'activity_types' => prepareSelect($activity_type),
            ],
        ], 200);
    }
    public function makeFake()
    {
        $row1 = [
            'logo_corp' => 'https://cdn-icons-png.flaticon.com/512/9371/9371369.png',
            'user_image' => 'https://images.rawpixel.com/image_800/czNmcy1wcml2YXRlL3Jhd3BpeGVsX2ltYWdlcy93ZWJzaXRlX2NvbnRlbnQvbHIvdjkzNy1hZXctMTY1LWtsaGN3ZWNtLmpwZw.jpg',
            'first_name' => 'کاظم',
            'last_name' => 'داعی',
            'corp_name' => 'توليدي لنت ترمز ايران',
            'year_created' => '2014',
            'province' => 'البرز',
            'province_id' => '456',
            'city' => 'اشتهارد',
            'address' => 'اشتهارد شهرک صنعتي اشتهارد بلوار غزالي غربي گلنوش ۲ گلفام ۱ قطعه ۲۵۱۷',
            'phone' => '۰۲۶۳۳۴۰۵۸۵۷',
            'fax' => '۰۲۶۳۷۷۷۷۸۳۱',
            'website' => 'http://www.sunpack.ir',
            'activity' => '(۰۴) چوب و کاغذ و مصنوعات وابسته (قسمت ۹و۱۰ کتاب)
(۰۷) برق، الکترونيک، مخابرات، ارتباطات و ماشين آلات، وسايل و مصنوعات وابسته (قسمت ۱۶ کتاب)
(۰۸) فلزات معمولي و مصنوعات وابسته (قسمت ۱۵ کتاب)',
            'activity_type' => '
            تولید-واردات-صادرات --> محصولات صنعت آرد سازی - مالت - نشاسته و فکول - اینولین - گلوتن گندم
تولید-واردات-صادرات --> دانه و میوه های روغن دار- دانه و بذر میوه های گوناگون - نباتات صنعتی یا دارویی - کاه و نواله
تولید-واردات-صادرات --> محصولات شیمیایی غیر آلی با ترکیبات آلی یا غیرآلی فلزات گرانبها- عناصررادیواکتیو- فلزات خاکهای کمیاب و ایزوتوپها
تولید-واردات-صادرات --> محصولات شیمیایی آلی
تولید-واردات-صادرات --> محصولات دارویی
تولید-واردات-صادرات --> محصولات گوناگون و صنایع شیمیایی
تولید-واردات-صادرات --> کائوچو و اشیاأ ساخته شده از کائوچو
تولید-واردات-صادرات --> اشیاأ ساخته شده از چرم - مصنوعات زین و برگ سازی - لوازم سفر- کیفهای دستی و محفظه های همانند- اشیا ساخته شده از روده به غیر از اشیا ساخته شده از احشا کرم ابریشم
تولید-واردات-صادرات --> کاغذ و مقوا- اشیا ساخته شده از خمیر کاغذ- از کاغذ یا مقوا
تولید-واردات-صادرات --> راکتورهای هسته ای - دیگ بخار وآبگرم - ماشین آلات و وسایل مکانیکی - اجزا و قطعات آنها
تولید-واردات-صادرات --> آلات و دستگاههای اپتیک - عکاسی - سینماتوگرافی - سنجش و کنترل
تولید-واردات-صادرات --> قطعات منفصله ماشین الات راهسازی -خودرو و سایر ماشین الات
تولید-واردات-صادرات --> محصولات نباتی
تولید-واردات-صادرات --> صنایع شیمیایی
تولید-واردات-صادرات --> پلاستیک / لاستیک
تولید-واردات-صادرات --> پوست خام، پوست، چرم و پوست
تولید-واردات-صادرات --> خمیر چوب؛ کاغذ و مقوا
تولید-واردات-صادرات --> فلزات معمولی و مصنوعات آنها
تولید-واردات-صادرات --> ماشین آلات / برق
تولید-واردات-صادرات --> لاستیک رویی چرخ بادی باسطح تماس به شکل استخوان شاه ماهی برای ماشین الات کشاورزی یا جنگلدا ری دارا
تولید-واردات-صادرات --> اشیاء از چرم طبیعی یا از چرم دوباره ساخته شده از نوع مورد مصرف در ماشین الات یا وسایل مکانیکی یا برا
تولید-واردات-صادرات --> کارتن ,قوطی ,جعبه ا زکاغذیامقوا ی موج دا ر
تولید-واردات-صادرات --> ساير
تولید-واردات-صادرات --> سایرماشین الات توزین باظرفیت بین 30تا5000کیلوگرم جزباسکول ا لکترونیکی سیار500 کیلوگرم به بالا
تولید-واردات-صادرات --> ماشین هابرا ی ساختن کارتن, جعبه, وغیره ا زکاغذیامقوا (غیراز ساختن به طریق قالب گیری )
تولید-واردات-صادرات --> ماشین الات لاستیک دراور
تولید-واردات-صادرات --> کارتن،قوطی و جعبه،تاشو،از کاغذ یا مقوای غیرموجدار

            ',
            'activity_type_id' => '8890',
            'orders_registered' => '
            کود NPKدربسته های کمتراز10کیلوگرم
سایرکودهای غیرمذکور
            ',
            'imports_done' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            'certificate_issued' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            'common_rooms' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            'spec_commissions' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            'organizations' => '
            اتحادیه تولید كنندگان و صادركنندگان روغن نباتی ایران
اتحادیه تولید کنندگان و صادرکنندگان فرش ایران
اتحادیه تولید و صادرات نساجی و پوشاك ایران
اتحادیه تولیدكنندگان، بازرگانان و صنایع بسته بندی چای كشور
اتحادیه تولیدكنندگان و صادركنندگان انواع چیپس و فرآورده های حجیم شده بر پایه ذرت
اتحادیه تولیدكنندگان و صادركنندگان چرم مصنوعی ایران
اتحادیه تولیدكنندگان و صادركنندگان سالامبور و چرم
اتحادیه تولیدكنندگان و صادركنندگان طلا، جواهر، نقره و سنگهای قیمتی ایران
اتحادیه تولیدكنندگان و صادركنندگان ماشین ها و ادوات كشاورزی ایران
اتحادیه تولیدكنندگان وصادركنندگان نان ایران
اتحادیه شركتهای ویدیو رسانه (سینمای خانگی )
اتحادیه صادرکنندگان آبزیان ایران
اتحادیه صادرکنندگان تجهیزات پزشكی ایران
اتحادیه صادركنندگان خشكبار
اتحادیه صادركنندگان صنعت چاپ ایران
اتحادیه ملی محصولات كشاورزی ایران
اتحادیه واردكنندگان دارو
انجمن تولیدكنندگان و صادركنندگان سنگ آهن ایران
انجمن تولیدکنندگان و صادرکنندگان محصولات بیوتکنولوژی پزشکی ایران
انجمن تولیدكنندگان و صادركنندگان مولیبدن
انجمن تولیدكنندگان و واردكنندگان ماشین آلات سنگین معدنی ،ساختمانی و راهسازی
انجمن خدمات بازار یابی بین المللی
انجمن خدمات بین المللی سلامت
انجمن سازندگان قطعات و مجموعه های خودرو
انجمن سرمایه گذاریهای مشترک ایران و خارجی
انجمن سنگ ایران
انجمن شرکت های اتوماسیون صنعتی
انجمن شرکت های توزیع برق
انجمن صنایع بیسکویت، شیرینی و شکلات ایران
انجمن صنایع شوینده ،بهداشتی و آرایشی ایران
انجمن صنایع فرآورده های لبنی ایران
انجمن صنایع قندوشكر ایران
انجمن مدیریت کیفیت ایران
انجمن مدیریت منابع انسانی ایران
انجمن ملی خرمای ایران
انجمن ملی صنایع پلاستیک و پلیمرایران
انجمن وارد کنندگان فرآورده های بهداشتی، آرایشی و عطریات ایران
انجمن واردکنندگان خودرو
سندیکای تولید کنندگان خمیر مایه ایران
سندیکای تولید کنندگان کاغذ و مقوای ایران
سندیکای تولید کنندگان و صادرکنندگان داروهای دامپزشکی ایران
سندیکای تولیدکنندگان رنگ و رزین ایران
سنديکاي توليدکنندگان سرنگ و سرسوزن ايران
سندیکای تولیدکنندگان مواد شیمیایی، داروئی و بسته بندی داروئی
شورای بازرگانی ایرانیان – دبی
کانون انجمن های صنایع غذایی ایران
کانون شبکه مشاوران مدیریت و مهندسی ایران
کنفدراسیون (مجمع) صادرات ایران
گروه وارد کنندگان و نمایندگان شرکت های خارجی ( مجمع واردات)
مجمع تشکل های دانش بنیان
مجمع تشکل های فناوری ارتباطات و اطلاعات ایران
            ',
            'person_type' => 'حقیقی',
            'person_type_id' => '78880',
            'hs_code' => '؛ۀٌص-بیثلی-dihgg',
            'products' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
            'rank' => 'سیمین 2 ستاره',
            'rank_id' => '0494956863',
            'last_updated_at' => Pdate::persianTimeStampNow(),
        ];
        $counter = 100000;
        $appender = [];
        for ($i = 0; $i <= $counter - 1; $i++) {
            $id = $i + 6;
            $row1['id'] = $id;
            $appender[] = $row1;
        }
        // dd($appender);
    }
}
